In [49]:
import pandas as pd

In [51]:
df = pd.read_csv('data/test.csv')
df

               Name  Age         City  Total     Sex  Graduate
0   Prosenjit Sinha   43    Manalapan    860    Male      True
1    Priyasha Sinha   16  Englishtown    900  Female      True
2  Priyankana Dutta   41    Manalapan   1000    Male     False
3      Prayan Sinha    8        Ocean   1200  Female     False

In [53]:
df_prayan = df.query('Name == "Prayan Sinha"')[['Age']]
df_prayan
df = df.set_index('Name')
df['ratio'] = df['Age'] / df_prayan['Age'].values[0]
df

                  Age         City  Total     Sex  Graduate  ratio
Name
Prosenjit Sinha    43    Manalapan    860    Male      True  5.375
Priyasha Sinha     16  Englishtown    900  Female      True  2.000
Priyankana Dutta   41    Manalapan   1000    Male     False  5.125
Prayan Sinha        8        Ocean   1200  Female     False  1.000